import math #Библиотека math, которая позволяет производить расширенные математические операции
import numpy #Библиотека для работы с числами, последовательностями, списками
import matplotlib.pyplot as mpp #Библиотека для построения зависимостей и графиков функций

if __name__=='__main__':
    arguments = numpy.arange(0, 200, 0.1) #Переменная arguments включает все значения от 0 до 199,9 с шагом 0,1
    mpp.plot( 
        arguments,#Значения arguments откладываются по оси абсцисс
        [math.cos(3*a) * math.sin(a/20) for a in arguments]
        #Построение заданного графика зависимости от а, где а принимает каждое значение из arguments
    )
    mpp.show() #Вывод полученного графика